/**
 * Напишите программу, которая определяет, сколько слов в сроке (ввод с консоли).
 */
package arrays;

public class WordsInTheLine {

    public static void main(String[] args) {

        for (int i = 0; i < 1; i++) {
            System.out.println(args.length);
        }
    }
}
