/**
 * Напишите программу, которая определяет, сколько слов в сроке (ввод с консоли).
 */
package tasks;

public class WordsInTheLine {

    public static void main(String[] args) {

        System.out.println(args.length);
    }
}
